x = int (input ('Введите номер месяца'))
if x==1:
    print ('Вы ввели январь. 31 день')
elif x==2:
     print ('Вы ввели  февраль. 28 дней')
elif x==3:
    print ('Вы ввели  март. 31 день')
elif x==4:
    print ('Вы ввели  апрель. 30 дней')  
elif x==5:
    print ('Вы ввели  май. 31 день')  
elif x==6:
    print ('Вы ввели  июнь. 30 дней')
elif x==7:
    print ('Вы ввели  июль. 31 день')
elif x==8:
    print ('Вы ввели  август. 31 день')
elif x==9:
    print ('Вы ввели  сентябрь. 30 дней')
elif x==10:
    print ('Вы ввели  октябрь. 31 день')
elif x==11:
    print ('Вы ввели  ноябрь. 30 дней')
elif x==12:
    print ('Вы ввели  декабрь. 31 день')
else:
    print ('Такого месяца не существует')